{
  "tasks": [
    {
      "id": 1,
      "chapter": "strings",
      "description": "Функция принимает один аргумент (строку) и возвращает объект с полями, равными каждому символу в этой строке. Значениями полей являются количества вхождения каждого символа в строку. Пример: для строки <kbd>abca</kbd> функция должна вернуть объект <kbd>{a: 2, b: 1, c: 1}</kbd>.",
      "method": "str2obj"
    },
    {
      "id": 2,
      "chapter": "strings",
      "description": "Функция принимает один аргумент (строку) и проверяет, является ли одна палиндромом (возвращает <kbd>true</kbd>, если строка палиндром, <kbd>false</kbd> - если нет).",
      "method": "isPalindrome"
    },
    {
      "id": 3,
      "chapter": "strings",
      "description": "Функция принимает один аргумент (строку) и возвращает ее копию с вырезанными всеми пробельными символами (\\n, \\t, \\r, ' ').",
      "method": "superTrim"
    },
    {
      "id": 4,
      "chapter": "strings",
      "description": "Функция принимает один аргумент (строку) и возвращает кол-во уникальных символов в ней. Пример: строка <kbd>abca</kbd>, функция вернет 3.",
      "method": "getUniqueCharsNumber"
    },
    {
      "id": 5,
      "chapter": "strings",
      "description": "Функция принимает один аргумент (строку) и возвращает строку, состоящую из символов, которые стоят на четных позициях строки-аргумента. Пример: строка <kbd>abcdef</kbd>, функция вернет <kbd>bdf</kbd>.",
      "method": "getEvenChars"
    },
    {
      "id": 6,
      "chapter": "strings",
      "description": "Функция принимает один аргумент (строку) и возвращает сумму кодов ее символов. В условии данной задачи аргументом может быть строка только из ascii-символов.",
      "method": "getAsciiCodesSum"
    },
    {
      "id": 7,
      "chapter": "strings",
      "description": "Функция принимает один аргумент (строку) и возвращает ее копию, отсортированную по возрастанию ascii-кодов ее символов. В условии данной задачи аргументов может быть строка только из ascii-символов. Пример: строка <kbd>dacbef</kbd>, функция вернет <kbd>abcdef</kbd>.",
      "method": "sortByAsciiCode"
    },
    {
      "id": 8,
      "chapter": "strings",
      "description": "Функция принимает два аргумента (строки), которые являются путями к файлам в файловой системе, и возвращает их общую часть. Пример: строка1 - <kbd>/path1/path2/path4.txt</kbd>, строка2 - <kbd>/path1/path2/path3.txt</kbd>, функция вернет <kbd>/path1/path2/</kbd>. В условии данной задачи у файла может быть только имя без расширения (<kbd>abc</kbd>), а может быть расширение, но без имени (<kbd>.htaccess</kbd>).",
      "method": "getCommonPath"
    },
    {
      "id": 9,
      "chapter": "strings",
      "description": "Функция принимает один аргумент (строку), которая является url и возвращает число, которое отвечает тому, домен какого уровня содержиться в url. Пример: url - <kbd>http://google.com/</kbd>, функция вернет <kbd>2</kbd>. В условии данной задачи url может не содержать закрывающую косую черту, может заканчиваться на точку (должна быть проигнорирована), в качестве протокола может быть http/https.",
      "method": "getDomainLevel"
    },
    {
      "id": 10,
      "chapter": "strings",
      "description": "Функция принимает один аргумент (строку), которая является номером телефона (любой наш моб. номер) и возвращает объект вида с частями этого номера. Пример: номер - <kbd>+380661234567</kbd>, функция вернет <kbd>{c: '+38', o: '066', p: '1234567'}</kbd>. В условии данной задачи необходимо учесть, что номер может содержать пробельные символы (это не только один пробел), скобки и знак минус.",
      "method": "parsePhone"
    },
    {
      "id": 11,
      "chapter": "strings",
      "description": "Функция принимает два аргумента (строку и число) и возвращает массив из частей строки размера, равного второму параметру функции. Если длина строки меньше, чем размер части, то вернуть массив из одного элемента (равному всей строке). Если длина строки не кратна размеру части, то последний элемент массива должен содержать остаток строки. Пример: строка <kbd>abcab</kbd>, число 2, функция вернет <kbd>['ab', 'ca', 'b']</kbd>.",
      "method": "getChunks"
    },
    {
      "id": 12,
      "chapter": "strings",
      "description": "Функция принимает один аргумент (строку) и возвращает ее копию, записанную в обратном порядке. В условии данной задачи строка-аргумент может состоять только из ascii-символов.",
      "method": "getReversed"
    },
    {
      "id": 13,
      "chapter": "strings",
      "description": "Функция принимает два аргумента (строки) и возвращает количество вхождений второго аргумента в первый. Пример: строка1 - <kbd>abcabc</kbd>, строка2 - <kbd>ab</kbd>, функция вернет 2. Если один из аргументов является пустой строкой, функция возвращает 0.",
      "method": "getEntriesCount"
    },
    {
      "id": 14,
      "chapter": "strings",
      "description": "Функция принимает два аргумента (строки) и проверяет, начинается ли первый аргумент со второго (возвращает <kbd>true</kbd>, если начинается, <kbd>false</kbd> - иначе). Если один из агрументов пустая строка, функция возвращает <kbd>false</kbd>.",
      "method": "startWith"
    },
    {
      "id": 15,
      "chapter": "strings",
      "description": "Функция принимает два аргумента (строки) и проверяет, являются ли они равными, если не учитывать их регистр (возвращает <kbd>true</kbd>, если равны, <kbd>false</kbd> - иначе). В условии данной задачи строки-аргументы могут состоять только из ascii-символов. Пример: строка1 - <kbd>aBcDeF</kbd>, строка2 - <kbd>AbCdEf</kbd>, функция вернет <kbd>true</kbd>.",
      "method": "isEqualIgnoreCase"
    },
    {
      "id": 16,
      "chapter": "strings",
      "description": "Функция принимает один аргумент (строку) и проверяет, что она является однострочной (возвращает <kbd>true</kbd>, если является, <kbd>false</kbd> - иначе).",
      "method": "isSingleLine"
    },
    {
      "id": 17,
      "chapter": "strings",
      "description": "Функция принимает два аргумента (строки), которые являются доменами (без протокола, пути, параметров и т.д), и возвращает их общую часть. Пример: строка1 - <kbd>adds.google.com</kbd>, строка2 - <kbd>maps.google.com</kbd>, функция возвращает <kbd>google.com</kbd>.",
      "method": "getCommonDomain"
    },
    {
      "id": 18,
      "chapter": "strings",
      "description": "Функция принимает три параметра (строка, строка, число) и возвращает копию первой строки, в которую после символа на позиции, равной третьему параметру, вставляется вторая строка. Пример: строка1 - <kbd>abcfg</kbd>, строка2 - <kbd>de</kbd>, число - <kbd>3</kbd>, функция вернет <kbd>abcdefg</kbd>.",
      "method": "smartInsert"
    },
    {
      "id": 19,
      "chapter": "strings",
      "description": "Функция принимает любое кол-во аргументов (строк) и возвращает самую длинную из них. Если аргументов передано не было, то возвращает <kbd>null</kbd>. Если у нескольких строк одинаковая длина и она максимальная, то вернуть последнюю из них.",
      "method": "getLongest"
    },
    {
      "id": 20,
      "chapter": "strings",
      "description": "Функция принимает два параметра (строки) и возвращает строку, которая состоит из четных символов первого аргумента и нечетных символов второго аргумента, идущие один за другим. Если аргументы разной длины, то нужные символы более длинной строки дописываются в строку-результат. Пример: строка1 - <kbd>abcde</kbd>, строка2 - <kbd>1234567</kbd>, функция вернет <kbd>b1d357</kbd>.",
      "method": "smartConcat"
    },
    {
      "id": 21,
      "chapter": "objects",
      "description": "Функция принимает два параметра (объект и массив строк) и возвращает новый объект, состоящий из полей, перечисленных в массиве. Если в исходном объекте нет поля с именем, которое есть в массиве, то оно игнорируется. Пример: объект - <kbd>{a: 1, b: 2, c: 3, d: 4}</kbd>, массив - <kbd>['a', 'b', 'e']</kbd>, функция вернет - <kbd>{a: 1, b: 2}</kbd>.",
      "method": "getCustomProperties"
    },
    {
      "id": 22,
      "chapter": "objects",
      "description": "Функция принимает два параметра (объекты) и возвращает массив, состоящий из полей, которые есть в обоих параметрах. Пример: объект1 - <kbd>{a: 1, b: 2, c: 3, d: 4}</kbd>, объект2 - <kbd>{a: 4, c: 2, e: 7}</kbd>, функция вернет - <kbd>['a', 'c']</kbd>.",
      "method": "getCommonKeys"
    },
    {
      "id": 23,
      "chapter": "arrays",
      "description": "Функция принимает один параметр (вектор чисел) и возвращает их сумму. Если массив пустой, то возвращает <kbd>null</kbd>.",
      "method": "getSum"
    },
    {
      "id": 24,
      "chapter": "arrays",
      "description": "Функция приминает один параметр (вектор строк) и возвращает их конкатенацию. Если массив пустой, то возвращает <kbd>''</kbd>.",
      "method": "getConcat"
    },
    {
      "id": 25,
      "chapter": "arrays",
      "description": "Функция принимает один параметр (вектор) и возвращает другой массив, состоящий из элементов первого массива, стоящих на четных позициях массива-аргумента.",
      "method": "getEvenElements"
    },
    {
      "id": 26,
      "chapter": "arrays",
      "description": "Функция принимает один параметр (матрицу N*N) и возвращает вектор длинной N, состоящий их элементов матрицы, стоящих на главной диагонали.",
      "method": "getMainDiagonal"
    },
    {
      "id": 27,
      "chapter": "arrays",
      "description": "Функция принимает один параметр (матрицу N*N) и возвращает вектор длинной N, состоящий их элементов матрицы, стоящих на побочной диагонали.",
      "method": "getSecondaryDiagonal"
    },
    {
      "id": 28,
      "chapter": "arrays",
      "description": "Функция принимает один параметр (матрицу N*M) и возвращает матрицу, состоящую из четных строк исходной.",
      "method": "getEvenLines"
    },
    {
      "id": 29,
      "chapter": "arrays",
      "description": "Функция принимает один параметр (матрицу N*M) и возвращает матрицу, состоящую из нечетных столбцов исходной.",
      "method": "getOddColumns"
    },
    {
      "id": 30,
      "chapter": "arrays",
      "description": "Функция принимает один параметр (вектор чисел) и возвращает индекс последнего максимального из них. Если массив пустой, вернуть <kbd>-1</kbd>.",
      "method": "getIndexOfMax"
    },
    {
      "id": 31,
      "chapter": "arrays",
      "description": "Функция принимает один параметр (вектор) и возвращает новый массив, состоящий из элементов исходного массива стоящих на четных позициях, но взятых в обратном порядке. Пример: вектор - <kbd>[1,2,3,4,5,6,7]</kbd>, функция вернет - <kbd>[6,4,2]</kbd>.",
      "method": "getEvenIndexedElementReversed"
    },
    {
      "id": 32,
      "chapter": "arrays",
      "description": "Функция принимает два параметра (вектор строк, строка) и возвращает новый массив из элементов исходного, у которых есть подстрока, равная второму параметру функции.",
      "method": "getWithSubstr"
    },
    {
      "id": 33,
      "chapter": "arrays",
      "description": "Функция принимает один параметр (матрица чисел N*N, N - четное) и возвращает новую матрицу размером N/2 * N и состоящую по четным строчкам из четных элементов, а по нечетным строчкам из нечетных элементов исходной матрицы. Пример: матрица - <kbd>[[1,2,3,4],[5,6,7,8],[9,10,11,12],[13,14,15,16]]</kbd>, функция вернет - <kbd>[[1,3],[6,8],[9,11],[14,16]]</kbd>.",
      "method": "getOddEvenElements"
    },
    {
      "id": 34,
      "chapter": "arrays",
      "description": "Функция принимает один параметр (матрица чисел N*M) и возвращает вектор, который состоит из всех элементов матрицы, если ее обходить змейкой, начиная с [0,0]. Пример: матрица - <kbd>[[1,2,3],[4,5,6],[7,8,9]]</kbd>, функция вернет - <kbd>[1,2,3,6,5,4,7,8,9]</kbd>.",
      "method": "getSnake00"
    },
    {
      "id": 35,
      "chapter": "arrays",
      "description": "Функция принимает один параметр (матрица чисел N*M) и возвращает вектор, который состоит из всех элементов матрицы, если ее обходить змейкой, начиная с [N,M]. Пример: матрица - <kbd>[[1,2,3],[4,5,6],[7,8,9]]</kbd>, функция вернет - <kbd>[9,8,7,4,5,6,3,2,1]</kbd>.",
      "method": "getSnakeNM"
    },
    {
      "id": 36,
      "chapter": "arrays",
      "description": "Функция принимает один параметр (матрица чисел N*M) и возвращает вектор, который состоит из всех элементов матрицы, если ее обходить змейкой, начиная с [0,M]. Пример: матрица - <kbd>[[1,2,3],[4,5,6],[7,8,9]]</kbd>, функция вернет - <kbd>[3,2,1,4,5,6,9,8,7]</kbd>.",
      "method": "getSnake0M"
    },
    {
      "id": 37,
      "chapter": "arrays",
      "description": "Функция принимает один параметр (матрица чисел N*M) и возвращает вектор, который состоит из всех элементов матрицы, если ее обходить змейкой, начиная с [N,0]. Пример: матрица - <kbd>[[1,2,3],[4,5,6],[7,8,9]]</kbd>, функция вернет - <kbd>[7,8,9,6,5,4,1,2,3]</kbd>.",
      "method": "getSnakeN0"
    },
    {
      "id": 38,
      "chapter": "arrays",
      "description": "Функция принимает два параметра (векторы с числами) и возвращает вектор, элементы которого - суммы соответствующих элементов векторов-параметров. Пример: вектор1 - <kbd>[1,2,3]</kbd>, вектор2 - <kbd>[1,2,3,5]</kbd>, функция вернет - <kbd>[2,4,6,5]</kbd>.",
      "method": "getVectorsSum"
    },
    {
      "id": 39,
      "chapter": "arrays",
      "description": "Функция принимает два параметра (векторы с числами) и возвращает вектор, элементы которого - суммы соответствующих элементов векторов-параметров. Если длина массивов разная, то суммирование продолжается с начала короткого массива. Пример: вектор1 - <kbd>[1,1,1,1,1,1,1]</kbd>, вектор2 - <kbd>[1,2,3]</kbd>, функция вернет - <kbd>[2,3,4,2,3,4,2]</kbd>.",
      "method": "getVectorsSum2"
    },
    {
      "id": 40,
      "chapter": "arrays",
      "description": "Функция принимает один параметр (вектор размера N^2, где N - натуральное число) и возвращает матрицу N*N. Пример: вектор - <kbd>[1,2,3,4,5,6,7,8,9]</kbd>, функция вернет - <kbd>[[1,2,3],[4,5,6],[7,8,9]]</kbd>.",
      "method": "vector2matrix"
    },
    {
      "id": 41,
      "chapter": "ajax",
      "description": "Функция принимает один параметр (объект) и отправляет его методом <kbd>POST</kbd> по ссылке <kbd>/tests/myscript</kbd>.",
      "method": "sendPostData"
    },
    {
      "id": 42,
      "chapter": "numbers",
      "description": "Функция принимает любое количество параметров (чисел) и возвращает самое большое из них (<kbd>Math.max</kbd> использовать нельзя). Если агрументов не передано, функция должна вернуть <kbd>null</kbd>.",
      "method": "getMax"
    },
    {
      "id": 43,
      "chapter": "numbers",
      "description": "Функция принимает два параметра (любое положительное число и любое натуральное число) и возвращает корень первого параметра степени второго параметра. Пример: число1 - <kbd>125</kbd>, число2 - <kbd>3</kbd>, функция вернет - <kbd>5</kbd>.",
      "method": "getCustomRoot"
    },
    {
      "id": 44,
      "chapter": "objects",
      "description": "Функция принимает два параметра (объект и строку). Строка является собой запись вида <kbd>a.b.c</kbd> (пустой быть не может), а объект в качестве полей может содержать другие объекты (вложенность произвольная). Функция возвращает значение поля объекта по пути, равному второму параметру функции (<kbd>.</kbd> является разделителем между вложенными объектами). Если такого пути нет, функция должна вернуть <kbd>null</kbd>. Пример: объект - <kbd>{a: {b: {c: 123'}}}</kbd>, строка - <kbd>'a.b.c'</kbd>, функция вернет - <kbd>123</kbd>.",
      "method": "getCustomPath"
    },
    {
      "id": 45,
      "chapter": "objects",
      "description": "Функция принимает один параметр (объект) и возвращает новый объект, ключами которого являются значения из первого объекта, а значениями - ключи из первого объекта. Пример: объект - <kbd>{a: 123, b: 2, c: 123}</kbd>, функция вернет - <kbd>{'123': 'a', '2': 'b'}</kbd>. Обратить внимание, что совпадающие значения должны перезатираться самым последним ключом.",
      "method": "invertObject"
    },
    {
      "id": 46,
      "chapter": "objects",
      "description": "Функция принимает один параметр (объект) и возвращает новый объект, ключами которого являются значения из первого объекта, а значениями - ключи из первого объекта. Пример: объект - <kbd>{a: 123, b: 2, c: 123}</kbd>, функция вернет - <kbd>{'123': ['a', 'c'], '2': 'b'}</kbd>. Обратить внимание, что совпадающие значения не должны перезатираться (ключи записываются в массив).",
      "method": "invertObjectWithoutOverride"
    },
    {
      "id": 47,
      "chapter": "objects",
      "description": "Функция принимает один параметр (объект) и возвращает массив с именами методов, которые есть у этого объекта. Пример: объект - <kbd>{a: 1, b: function() {}, c: 'abc', d: function () {} }</kbd>, функция вернет - <kbd>['b', 'd']</kbd>.",
      "method": "getFunctionNames"
    },
    {
      "id": 48,
      "chapter": "objects",
      "description": "Функция принимает один параметр (объект). В зависимости от его типа возвращает следующее: строка - string, число - number, логическое значение - boolean, массив - array, объект - object (для объекта-даты - date, для объекта-ошибки - error), функция - function, null - null, ничего - undefined, RegExp - regexp.",
      "method": "smartGetType"
    },
    {
      "id": 49,
      "chapter": "objects",
      "description": "Функция принимает один параметр (объект) и возвращает количество его собственных полей.",
      "method": "getOwnPropertiesCount"
    },
    {
      "id": 50,
      "chapter": "objects",
      "description": "Функция принимает произвольное кол-во параметров (объекты) и возвращает имена полей, которые есть у каждого объекта.",
      "method": "getCommonKeys2"
    },
    {
      "id": 51,
      "chapter": "objects",
      "description": "Функция принимает один параметр (любой тип) и возвращает <kbd>true</kbd>, если он <kbd>null</kbd> или <kbd>undefined</kbd>.",
      "method": "checkIsNone"
    },
    {
      "id": 52,
      "chapter": "numbers",
      "description": "Функция принимает два параметра (любое рациональное число и любое натуральное число) и возвращает целое число, которое ближе всего к первому параметру и кратно второму.",
      "method": "getNearestNumber"
    },
    {
      "id": 53,
      "chapter": "numbers",
      "description": "Функция принимает три параметра (числа) и возвращает <kbd>true</kbd>, если первый параметр попадает в диапазон между вторым и третьим (сравнение не строгое), иначе возвращает <kbd>false</kbd>.",
      "method": "checkInRange"
    },
    {
      "id": 54,
      "chapter": "numbers",
      "description": "Функция принимает один параметр (строку), который является IP-адресом и возвращает его числовой эквивалент.",
      "method": "ip2int"
    },
    {
      "id": 55,
      "chapter": "numbers",
      "description": "Функция принимает один параметр (число в диапазоне 0..4294967295) и возвращает его в формате IP-адреса.",
      "method": "int2ip"
    },
    {
      "id": 56,
      "chapter": "numbers",
      "description": "Функция принимает два параметра (строки с IP-адресами) и возвращает массив IP-адресов, которые находятся между ними (включая граничные адреса).",
      "method": "generateIpsRange"
    },
    {
      "id": 57,
      "chapter": "arrays",
      "description": "Функция принимает один параметр (любого типа) и, если он массив, то возвращает его без изменений, иначе - \"оборачивает\" его в массив. Пример1: параметр - <kbd>1234</kbd>, функция вернет - <kbd>[1234]</kbd>. Пример2: параметр - <kbd>[1234]</kbd>, функция вернет - <kbd>[1234]</kbd>.",
      "method": "makeArray"
    },
    {
      "id": 58,
      "chapter": "numbers",
      "description": "Функция принимает 4 параметра (числа), которые являются парами координат точек <kbd>x1, y1, x2, y2</kbd>, и вычисляет расстояние между этими точками.",
      "method": "getLine"
    },
    {
      "id": 59,
      "chapter": "numbers",
      "description": "Функция принимает 2 параметра (числа, которые являются степенями 2) и возвращает модуль разности этих степеней. Пример: число1 - <kbd>64</kbd>, число2 - <kbd>1024</kbd>, функция вернет <kbd>4</kbd>.",
      "method": "getSizeDiff"
    },
    {
      "id": 60,
      "chapter": "numbers",
      "description": "Функция принимает 1 параметр (число) и возвращает <kbd>true</kbd>, если оно простое, <kbd>false</kbd> - иначе.",
      "method": "checkIsPrime"
    },
    {
      "id": 61,
      "chapter": "numbers",
      "description": "Функция принимает 2 параметра (целые числа) и возвращает <kbd>true</kbd>, если первое является какой-то степенью второго числа, <kbd>false</kbd> - иначе.",
      "method": "checkPow"
    },
    {
      "id": 62,
      "chapter": "numbers",
      "description": "Функция принимает 1 параметр (число - кол-во байт) и возвращает максимально возможную единицу измерения для этого числа (но не больше PB). Точность - два знака после запятой. Пример: число - <kbd>10000</kbd>, функция вернет - <kbd>9.76 KB</kbd>.",
      "method": "getMaxSize"
    },
    {
      "id": 63,
      "chapter": "numbers",
      "description": "Функция принимает 3 параметра (натуральные числа) и возвращает <kbd>true</kbd>, если треугольник с такими сторонами является прямоугольным, <kbd>false</kbd> - иначе.",
      "method": "checkTriangle"
    },
    {
      "id": 64,
      "chapter": "numbers",
      "description": "Функция принимает 3 параметра (числа) и проверяет, входит ли точка с координатами, равными первым двум параметрам в круг с радиусом, равным третьему параметру, и центром в начале координат.",
      "method": "checkDotInCircle"
    },
    {
      "id": 65,
      "chapter": "numbers",
      "description": "Функция принимает 1 параметр (натуральное число больше 100) и возвращает <kbd>true</kbd>, если все его цифры разные, <kbd>false</kbd> - иначе.",
      "method": "checkAllDigitsUnique"
    },
    {
      "id": 66,
      "chapter": "arguments",
      "description": "Функция может принимать любое кол-во параметров (в описании функции не должно быть объявлено никаких параметров) и возвращает <kbd>true</kbd>, если передано больше трех параметров, <kbd>false</kbd> - иначе.",
      "method": "checkParametersCount"
    },
    {
      "id": 67,
      "chapter": "arguments",
      "description": "Функция может принимать любое кол-во параметров (в описании функции не должно быть объявлено никаких параметров). Если вторым параметром ей передана другая функция, то необходимо выполнить ее.",
      "method": "execSecondParameter"
    },
    {
      "id": 68,
      "chapter": "arguments",
      "description": "Функция может принимать любое кол-во параметров (в описании функции не должно быть объявлено никаких параметров). Если первым параметром передано имя функции, которая есть у объекта <kbd>Math</kbd>, ее необходимо выполнить, передав в качестве параметров оставшиеся аргументы функции.",
      "method": "callIfExists"
    },
    {
      "id": 69,
      "chapter": "collections",
      "description": "Функция принимает 3 параметра (массив объектов, строка и mixed) и возвращает <kbd>true</kbd>, если у каждого элемента массива есть поле с именем, равным второму параметру, и со значением, равным третьему параметру, <kbd>false</kbd> - иначе.",
      "method": "checkEvery"
    },
    {
      "id": 70,
      "chapter": "collections",
      "description": "Функция принимает 3 параметра (массив объектов, строка и mixed) и возвращает <kbd>true</kbd>, если хотя бы у одного элемента массива есть поле с именем, равным второму параметру, и со значением, равным третьему параметру, <kbd>false</kbd> - иначе.",
      "method": "checkSome"
    },
    {
      "id": 71,
      "chapter": "collections",
      "description": "Функция принимает 1 параметра (массив элементов разных типов) и возвращает новый массив, состоящий из элементов исходного, но без <kbd>null</kbd> и <kbd>undefined</kbd>.",
      "method": "compact"
    },
    {
      "id": 72,
      "chapter": "collections",
      "description": "Функция принимает 3 параметра (массив объектов, строка и mixed) и возвращает новый массив, состоящий из элементов исходного, у которых есть поле с именем, равным второму параметру, и со значением, равным третьему.",
      "method": "filterByProperty"
    },
    {
      "id": 73,
      "chapter": "collections",
      "description": "Функция принимает 3 параметра (массив объектов, строка и mixed) и возвращает первый элемент, у которго есть поле с именем, равным второму параметру, и со значением, равным третьему. Если таким элементов нет, то возвращает <kbd>null</kbd>.",
      "method": "findByProperty"
    },
    {
      "id": 74,
      "chapter": "collections",
      "description": "Функция принимает 3 параметра (массив объектов, строка и mixed) и возвращает новый массив, состоящий из элементов исходного, у которых значение поля с именем, равным второму параметру, не равно третьему параметру.",
      "method": "rejectByProperty"
    },
    {
      "id": 75,
      "chapter": "collections",
      "description": "Функция принимает 2 параметра (массив объектов и строку) и возвражает новый массив, состоящий из значений элементов исходного массива в поле с именем, равным второму параметру. Если такого поля у какого-то элемента нет, то брать <kbd>null</kbd>. Пример: массив - <kbd>[{a: 1}, {a: 2}, {}]</kbd>, строка - <kbd>'a'</kbd>, функция вернет - <kbd>[1,2,null]</kbd>.",
      "method": "mapByProperty"
    },
    {
      "id": 76,
      "chapter": "collections",
      "description": "Функция принимает 3 параметра (массив объектов, строка и mixed) и возвращает новый массив, состоящий из элементов исходного, у которых значение поля с именем, равным второму параметру, ставится равным третьему параметру. Пример: массив - <kbd>[{a: 1}, {}]</kbd>, строка - <kbd>'a'</kbd>, mixed - <kbd>123</kbd>, функция вернет - <kbd>[{a: 123}, {a: 123}]</kbd>.",
      "method": "setEachProperty"
    },
    {
      "id": 77,
      "chapter": "collections",
      "description": "Функция принимает два параметра (массив объектов и строка) и возвращает новый массив, состоящий из элементов исходного массива, которые отсортированы по возврастанию значения поля с именем, равным второму параметру. В условии данной задачи значениями полей объектов массива могут быть только числа или строки.",
      "method": "sortByProperty"
    },
    {
      "id": 78,
      "chapter": "collections",
      "description": "Функция принимает два параметра (массив объектов и строка) и возвращает объект, ключами которого являются уникальные значения поля с именем, равнім второму параметру, а значения - это массивы элементов, у которых это значение поля. Пример: массив - <kbd>[{a: 1, b: 2}, {a: 1, b: 3}, {a: 2, b: 1}]</kbd>, строка - <kbd>'a'</kbd>, функция вернет - <kbd>{'1': [{a: 1, b: 2}, {a: 1, b: 3}], '2': [{a: 2, b: 1}]}</kbd>.",
      "method": "groupByProperty"
    },
    {
      "id": 79,
      "chapter": "dom",
      "description": "Функция добавляет класс <kbd>abc</kbd> ко всем элементам списков, которые есть на странице.",
      "method": "addCustomClass"
    },
    {
      "id": 80,
      "chapter": "dom",
      "description": "Функция находит на странице элементы форм и делает следующее: <ul><li>кнопкам добавляет класс <kbd>btn</kbd></li> <li>radio-button'ам добавляет атрибут <kbd>rel</kbd> со значением <kbd>my-cool-radio</kbd></li><li>у checkbox'ов забирает класс <kbd>chbx</kbd></li></ul>",
      "method": "formUpdating"
    },
    {
      "id": 81,
      "chapter": "dom",
      "description": "Функция находит на странице таблицы и для каждой четной строчки тела таблицы добавляет класс <kbd>c1</kbd>, а для нечетной - <kbd>c2</kbd>.",
      "method": "tableProcessing"
    },
    {
      "id": 82,
      "chapter": "dom",
      "description": "Функция находит на странице все ссылки (<kbd>a</kbd>), которые находятся в абзаце (<kbd>p</kbd>) с классом <kbd>abc</kbd> и являются дочерними для блоков (<kbd>div</kbd>) с классом <kbd>dv</kbd>. Для найденных элементов добавляется класс <kbd>pwned</kbd>.",
      "method": "addClassBySelector"
    },
    {
      "id": 83,
      "chapter": "dom",
      "description": "Функция находит на странице все тэги <kbd>i</kbd>, соседние к <kbd>b</kbd> и вложенные в списки, и добавляет к ним класс <kbd>bfg</kbd>.",
      "method": "addClassBySelector2"
    },
    {
      "id": 84,
      "chapter": "dom",
      "description": "Функция находит на странице все абзацы (<kbd>p</kbd>), родственные к тегам заголовков (<kbd>h1..h6</kbd>) добавляет к ним класс <kbd>egm</kbd>.",
      "method": "addClassBySelector3"
    },
    {
      "id": 85,
      "chapter": "arguments",
      "description": "Функция может принимать любое кол-во параметров (в описании функции не должно быть объявлено никаких параметров). Если в качестве первого параметра передана функция, то необходимо вызвать ее с теми параметрами, которые были переданы в исходную.",
      "method": "customCall"
    },
    {
      "id": 86,
      "chapter": "arguments",
      "description": "Функция может принимать любое кол-во параметров (в описании функции не должно быть объявлено никаких параметров), одним из которых является функция (обязательно). Необходимо вызвать эту функцию с вргументами, которые в списке параметров идут после этой функции. Пример: параметры - <kbd>1, 2, Math.max, 3, 4, 5</kbd>, функция должна вызвать - <kbd>Math.max(3, 4, 5)</kbd>.",
      "method": "customCallAfter"
    },
    {
      "id": 87,
      "chapter": "dom",
      "description": "Функция находит на странице все элементы, у которых есть два и больше классов, и добавляет им класс <kbd>zxc</kbd>.",
      "method": "checkClassesCount"
    },
    {
      "id": 88,
      "chapter": "regexp",
      "description": "Функция принимает один параметр (строку) и возвращает ее копию, где заменяет группы цифр (от 2 до 4) на один символ <kbd>|</kbd> (между группами цифр есть хотя бы один \"нецифровой\" символ). Пример: строка - <kbd>1234a123b12c</kbd>, функция вернет - <kbd>|a|b|c</kbd>. В условии данной задачи аргументов может быть строка только из ascii-символов.",
      "method": "replaceDigits"
    },
    {
      "id": 89,
      "chapter": "regexp",
      "description": "Функция принимает один параметр (строку) и возвращает ее копию, где убирает подстроку <kbd>[..]</kbd> (между квадратными скобками могут быть буквы в любом регистре, цифры, знак подчеркивания) с начала строки. Пример: строка - <kbd>[a1_b2]abc[abc]123</kbd>, функция вернет - <kbd>abc[abc]123</kbd>. В условии данной задачи аргументов может быть строка только из ascii-символов.",
      "method": "removeFirst"
    },
    {
      "id": 90,
      "chapter": "regexp",
      "description": "Функция принимает один параметр (строку) и возвращает ее копию, где убирает заглавные буквы, идущие в конце строки. В условии данной задачи аргументов может быть строка только из ascii-символов.",
      "method": "removeLast"
    },
    {
      "id": 91,
      "chapter": "regexp",
      "description": "Функция принимает один параметр - строку вида <kbd>abc[2-4]d.efg</kbd> и возвращает массив строк вида <kbd>['abc2d.efg', 'abc3d.efg', 'abc4d.efg']</kbd>. Квадратные скобки с группой цифр могут быть только одни.",
      "method": "parseList"
    },
    {
      "id": 92,
      "chapter": "regexp",
      "description": "Функция принимает один параметр - строку вида <kbd>abc[2-3]d[1-2].efg</kbd> и возвращает массив строк вида <kbd>['abc2d1.efg', 'abc2d2.efg', 'abc3d1.efg', 'abc3d2.efg']</kbd>. Квадратных скобок с группой цифр могут быть сколько угодно.",
      "method": "parseList2"
    },
    {
      "id": 93,
      "chapter": "regexp",
      "description": "Функция принимает один параметр - строку, где есть телефонные номера вида <kbd>1234567, 123-45-67, 123-4567</kbd>. Функция возвщащает массив с этими номерами (в том виде, в котором они были в строке). Между номерами телефонов всегда есть какой-то символ.",
      "method": "parsePhones"
    },
    {
      "id": 94,
      "chapter": "regexp",
      "description": "Функция принимает один параметр - массив строк, в каждой из которых есть одна подстрока вида <kbd>$ 123.45</kbd>. Функция возвращает отсортированный по этим подстрокам массив. Пример: массив - <kbd>['abc $ 12.33', '$4.54', 'abc $6.11 def']</kbd>, функция вернет - <kbd>['$4.54', 'abc $6.11 def', 'abc $ 12.33']</kbd>. Между знаком доллара и числом пробела может и не быть.",
      "method": "sortArrayBySubstring"
    },
    {
      "id": 95,
      "chapter": "regexp",
      "description": "Функция принимает один параметр (строку) и возвращает новую строку, равную исходной, но в которой первое и последнее слово поменяны местами (разделителями между словами считаются любые символы не входящие в диапазоны <kbd>a-z, A-Z, 0-9</kbd>).",
      "method": "swapWords"
    },
    {
      "id": 96,
      "chapter": "regexp",
      "description": "Функция принимает один параметр (строку) и заменяет каждое вхождение символа <kbd>*</kbd> на его порядковый номер. Пример: строка - <kbd>a*b*c*</kbd>, функция вернет - <kbd>a1b2c3</kbd>.",
      "method": "replaceWithIndex"
    },
    {
      "id": 97,
      "chapter": "date",
      "description": "Функция принимает два параметра (числа), которые являются временными метками (в милисекундах) и вычисляет сколько полных лет прошло между ними.",
      "method": "getYearsDiff"
    },
    {
      "id": 98,
      "chapter": "date",
      "description": "Функция принимает два параметра (число и строка). Число являет собой временную метку (в милисекундах), а строка - формат вывода даты. Эта строка может включать следующее: <ul><li>YYYY - год в формате 2015</li><li>YY - год в формате 15</li><li>mm - месяц в формате 01-12 (с ведущим нулем)</li><li>MM - месяц в формате 1-12 (без ведущего 0)</li><li>dd - день в формате 01-31 (с ведущим нулем)</li><li>DD - день в формате 1-31  (без ведущего 0)</li><li>hh - часы в формате 01-24 (с ведущим нулем)</li><li>HH - часы в формате 1-24 (без ведущего 0)</li><li>ll - минуты в формате  01-60 (с ведущим нулем)</li><li>LL - минуты в формате 1-60 (без ведущего 0)</li><li>ss - секунды в формате 01-60 (с ведущим нулем)</li><li>SS - секунды в формате 1-60 (без ведущего 0)</li></ul>Пример: число - <kbd>1388538605000</kbd>, строка - <kbd>'YYYY/mm/dd hh:LL:ss'</kbd>, функция вернет - <kbd>2015/01/01 03:10:05</kbd>.",
      "method": "formatDate"
    },
    {
      "id": 99,
      "chapter": "date",
      "description": "Функция принимает два параметра (числа), которые являются временными метками (в милисекундах) и определяет максимальную (целую) величину разности между ними. Пример: числа - <kbd>1388538605000</kbd>, <kbd>1293840000000</kbd>, функция вернет - <kbd>3 years</kbd>. Необходимо учесть, что не обязательно первое число должно быть больше второго. Доступные суфиксы: <ul><li>год - year/years</li><li>месяц - month/months</li><li>неделя - week/weeks</li><li>день - day/days</li><li>час - hour/hours</li><li>минута - minute/minutes</li><li>секунда - second/seconds</li></ul>",
      "method": "getTimeAgo"
    },
    {
      "id": 100,
      "chapter": "date",
      "description": "Функция принимает один параметр (Date) и определяет попадает ли эта дата на високосный год.",
      "method": "checkLeapYear"
    },
    {
      "id": 101,
      "chapter": "objects",
      "description": "Функция принимает два параметра (объект, функция), выполняет функцию в контексте объекта и возвращает ее результат.",
      "method": "useContext"
    },
    {
      "id": 102,
      "chapter": "arrays",
      "description": "Функция принимает многомерный массив чисел (не пустой) N*N*...*N и возвращает сумму элементов его главной диагонали.",
      "method": "getSumForPrimaryDiagonalOfMultiDimensionArray"
    },
    {
      "id": 103,
      "chapter": "arrays",
      "description": "Функция принимает один параметр (многомерный массив чисел) и возвращает сумму всех его элементов.",
      "method": "getSumOfMultiDimensionalArray"
    },
    {
      "id": 104,
      "chapter": "arrays",
      "description": "Функция принимает один параметр (массив чисел N*M*K, N > 1, M > 1, K > 1) возвращает сумму элементов на его ребрах.",
      "method": "getEdgesSum"
    }
  ]
}